g3gg0/ESP32-UART-Gateway/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_BOOTLOADER_LOG_LEVEL_ERROR=y
CONFIG_ESPTOOLPY_NO_STUB=y
CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE=y
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y
CONFIG_RMT_RECV_FUNC_IN_IRAM=y
CONFIG_RMT_ENABLE_DEBUG_LOG=y
CONFIG_RMT_ISR_IRAM_SAFE=y
CONFIG_UART_ISR_IN_IRAM=y
CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=n
CONFIG_ESP_SYSTEM_USE_FRAME_POINTER=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4096
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_FREERTOS_ISR_STACKSIZE=4096
CONFIG_LOG_VERSION_2=y
CONFIG_LOG_DEFAULT_LEVEL_ERROR=y
CONFIG_LOG_COLORS=y
CONFIG_MBEDTLS_CMAC_C=y
CONFIG_MBEDTLS_ECP_FIXED_POINT_OPTIM=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
